Ran Plan for project: `platform-ops-automation` dir: `legacy-production/platform-ops-automation` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.pipeline_tls_automation_role.data.aws_iam_policy_document.sqs: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.kinesis: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.wafv2: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.ssm: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.secretsmanager: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.ec2: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.iam: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.connect_campaigns: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.eventbridge: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.ssm: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.kinesis: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.kms: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.connect_campaigns: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.wafv2: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.eventbridge: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.sqs: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.ec2: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.iam: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_caller_identity.current: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.s3: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.route53: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.kms: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.secretsmanager: Read complete after 0s [id=3671434251]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.elbv2: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.codeartifact: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.acm: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.sns: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.codeartifact: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.eks: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.acm: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.sns: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.cognito: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.s3: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.route53: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.elbv2: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.api_gateway: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.ecr: Reading...
module.pipeline_tls_automation_role.data.aws_caller_identity.current: Read complete after 0s [id=162555222078]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.cloudformation: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.efs: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.eks: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.waf_regional: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.dynamodb: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.shield: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.cognito: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.efs: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.api_gateway: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.ecr: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.cloudformation: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.rds: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.lambda: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.assume_role: Reading...
module.pipeline_tls_automation_role.data.aws_iam_policy_document.dynamodb: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.waf_regional: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.shield: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.lambda: Read complete after 0s [id=1132004489]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=4247458588]
module.pipeline_tls_automation_role.data.aws_iam_policy_document.rds: Read complete after 0s [id=1132004489]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.pipeline_tls_automation_role.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:TagSession",
+                           "sts:AssumeRoleWithWebIdentity",
+                           "sts:AssumeRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "repo:plentiau/platform-ops-automation:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS       = []
+                           Federated = "arn:aws:iam::519527725796:oidc-provider/token.actions.githubusercontent.com"
+                           Service   = []
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "pipeline-tls-automation-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.pipeline_tls_automation_role.aws_iam_role_policy.secretsmanager[0] will be created
+ resource "aws_iam_role_policy" "secretsmanager" {
+       id          = (known after apply)
+       name        = "SecretsManager"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "secretsmanager:ListSecretVersionIds",
+                           "secretsmanager:GetSecretValue",
+                           "secretsmanager:DescribeSecret",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:secretsmanager:ap-southeast-2:519527725796:secret:/test/services/*",
+                           "arn:aws:secretsmanager:ap-southeast-2:519527725796:secret:/production/services/*",
                        ]
                    },
+                   {
+                       Action   = "secretsmanager:ListSecrets"
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = "pipeline-tls-automation-role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pipeline_tls_automation_role_arn = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p platform-ops-automation
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.security.public.plenti.cloud/lock?id=plentiau%252Fterraform-plenti-iam%252Flegacy-production%252Fplatform-ops-automation%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p platform-ops-automation
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```